"""
Функции высшего порядка:
sorted(Итерируемый объект, ключ для сортировки) - сортирует элементы по ключу
map(ключ для модификации, Итерируемый объект) - модифицирует элементы по ключу
filter(ключ для фильтрации, Итерируемый объект) - фильтрует элементы по ключу
ключ - ссылка на функцию, которая возвращает какое - то значение
Пример: 
def key(a):
    return a

"""


# Ключ для фильтрации
def key(a):
    return a < 0  # возвращает True, либо False в зависимости от того, выполняется ли условие


a = [-5, -1, 0, -1, 100, -3, -22, 3, 9, 21]
# Передаём функцию в качестве ключа. Передать её нужно обязательно без круглых скобак, потому что если передать со скобками, то функция key() просто выполнится
# Правильно
sorted_list = filter(key, a)
# Не правильно
sorted_list = filter(key(), a)
# filter(key, a) фильтрует элементы по ключу (в данном случае - отбрасывет все элементы, которые не прошли проверку в функции key)

# так выглядит итерируемый объект
print(sorted_list)
# а так выглядит просто список
print(list(sorted_list))
