def my_func(x):  # Аргумент x
    x *= 4
#    return x  # возвращаем данные из функции


# Задаём неименнованный аргумент
y = my_func(100)  # передаём данные в функцию в качестве аргумента. (Задаём НЕИМЕНОВАННЫЙ аргумент)
print(y)
# Задаём именнованный аргумент
y = my_func(x=50)  # передаём данные в функцию в качестве аргумента. (Задаём ИМЕНОВАННЫЙ аргумент)
print(y)
# Передача именнованных и неименованных аргументов
# Именнованный аргумент "sep" нужен для определения символа разделителя между слов
# Именнованный Аргумент "end" нужен для определения символа в конце строки, по умолчению - это символ переноса строки
# print("Данные 1", "Данные 2", sep="@", end="!")
# print("Данные 1", "Данные 2", sep="|")